
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 6 to change, 5 to destroy.</code></pre>

* Update
  * azurerm_resource_group.rg
  * module.pcq-consolidation-fail-action-group-slack-email.azurerm_resource_group_template_deployment.action-group
  * module.pcq-consolidation-summary-action-group-slack.azurerm_resource_group_template_deployment.action-group
  * module.pcq-disposer-fail-action-group-slack.azurerm_resource_group_template_deployment.action-group
  * module.pcq-disposer-summary-action-group-slack.azurerm_resource_group_template_deployment.action-group
  * module.pcq-loader-failure-action-group-slack.azurerm_resource_group_template_deployment.action-group
* Replace
  * azurerm_key_vault_secret.pcq_storageaccount_primary_access_key
  * azurerm_key_vault_secret.pcq_storageaccount_primary_connection_string
  * azurerm_key_vault_secret.pcq_storageaccount_secondary_access_key
  * azurerm_key_vault_secret.pcq_storageaccount_secondary_connection_string
  * azurerm_key_vault_secret.storage_account_name


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault.pcq_key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "pcq_key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "pcq-aat"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + rbac_authorization_enabled      = (known after apply)
      + resource_group_name             = "pcq-aat"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # data.azurerm_key_vault_secret.pcqDisposerSummaryAlertEmail will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "pcqDisposerSummaryAlertEmail" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "pcqDisposerSummaryAlertEmail"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.pcqFailureAlertEmail will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "pcqFailureAlertEmail" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "pcqFailureAlertEmail"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.pcq_storageaccount_primary_access_key must be replaced
-/+ resource "azurerm_key_vault_secret" "pcq_storageaccount_primary_access_key" {
      ~ id                      = "https://pcq-aat.vault.azure.net/secrets/pcq-storage-account-primary-access-key/404df4901e624beaa9cccd0f20a363b7" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.KeyVault/vaults/pcq-aat" -> (known after apply) # forces replacement
        name                    = "pcq-storage-account-primary-access-key"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.KeyVault/vaults/pcq-aat/secrets/pcq-storage-account-primary-access-key/versions/404df4901e624beaa9cccd0f20a363b7" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.KeyVault/vaults/pcq-aat/secrets/pcq-storage-account-primary-access-key" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "404df4901e624beaa9cccd0f20a363b7" -> (known after apply)
      ~ versionless_id          = "https://pcq-aat.vault.azure.net/secrets/pcq-storage-account-primary-access-key" -> (known after apply)
        # (3 unchanged attributes hidden)

      - timeouts {}
    }

  # azurerm_key_vault_secret.pcq_storageaccount_primary_connection_string must be replaced
-/+ resource "azurerm_key_vault_secret" "pcq_storageaccount_primary_connection_string" {
      ~ id                      = "https://pcq-aat.vault.azure.net/secrets/pcq-storage-account-primary-connection-string/4fc257c2f1744348a3b68aeb87de1b4b" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.KeyVault/vaults/pcq-aat" -> (known after apply) # forces replacement
        name                    = "pcq-storage-account-primary-connection-string"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.KeyVault/vaults/pcq-aat/secrets/pcq-storage-account-primary-connection-string/versions/4fc257c2f1744348a3b68aeb87de1b4b" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.KeyVault/vaults/pcq-aat/secrets/pcq-storage-account-primary-connection-string" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "4fc257c2f1744348a3b68aeb87de1b4b" -> (known after apply)
      ~ versionless_id          = "https://pcq-aat.vault.azure.net/secrets/pcq-storage-account-primary-connection-string" -> (known after apply)
        # (3 unchanged attributes hidden)

      - timeouts {}
    }

  # azurerm_key_vault_secret.pcq_storageaccount_secondary_access_key must be replaced
-/+ resource "azurerm_key_vault_secret" "pcq_storageaccount_secondary_access_key" {
      ~ id                      = "https://pcq-aat.vault.azure.net/secrets/pcq-storage-account-secondary-access-key/393dc3b5c7724343919e0bfe61891fbb" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.KeyVault/vaults/pcq-aat" -> (known after apply) # forces replacement
        name                    = "pcq-storage-account-secondary-access-key"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.KeyVault/vaults/pcq-aat/secrets/pcq-storage-account-secondary-access-key/versions/393dc3b5c7724343919e0bfe61891fbb" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.KeyVault/vaults/pcq-aat/secrets/pcq-storage-account-secondary-access-key" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "393dc3b5c7724343919e0bfe61891fbb" -> (known after apply)
      ~ versionless_id          = "https://pcq-aat.vault.azure.net/secrets/pcq-storage-account-secondary-access-key" -> (known after apply)
        # (3 unchanged attributes hidden)

      - timeouts {}
    }

  # azurerm_key_vault_secret.pcq_storageaccount_secondary_connection_string must be replaced
-/+ resource "azurerm_key_vault_secret" "pcq_storageaccount_secondary_connection_string" {
      ~ id                      = "https://pcq-aat.vault.azure.net/secrets/pcq-storage-account-secondary-connection-string/b7a27f0b7f9947119f70bb2779d3887f" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.KeyVault/vaults/pcq-aat" -> (known after apply) # forces replacement
        name                    = "pcq-storage-account-secondary-connection-string"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.KeyVault/vaults/pcq-aat/secrets/pcq-storage-account-secondary-connection-string/versions/b7a27f0b7f9947119f70bb2779d3887f" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.KeyVault/vaults/pcq-aat/secrets/pcq-storage-account-secondary-connection-string" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "b7a27f0b7f9947119f70bb2779d3887f" -> (known after apply)
      ~ versionless_id          = "https://pcq-aat.vault.azure.net/secrets/pcq-storage-account-secondary-connection-string" -> (known after apply)
        # (3 unchanged attributes hidden)

      - timeouts {}
    }

  # azurerm_key_vault_secret.storage_account_name must be replaced
-/+ resource "azurerm_key_vault_secret" "storage_account_name" {
      ~ id                      = "https://pcq-aat.vault.azure.net/secrets/pcq-storage-account-name/f042bbef471244ec93feec788ea3964a" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.KeyVault/vaults/pcq-aat" -> (known after apply) # forces replacement
        name                    = "pcq-storage-account-name"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.KeyVault/vaults/pcq-aat/secrets/pcq-storage-account-name/versions/f042bbef471244ec93feec788ea3964a" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.KeyVault/vaults/pcq-aat/secrets/pcq-storage-account-name" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "f042bbef471244ec93feec788ea3964a" -> (known after apply)
      ~ versionless_id          = "https://pcq-aat.vault.azure.net/secrets/pcq-storage-account-name" -> (known after apply)
        # (3 unchanged attributes hidden)

      - timeouts {}
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat"
        name       = "pcq-aat"
        tags       = {}
        # (2 unchanged attributes hidden)

      - timeouts {}
    }

  # module.pcq-consolidation-fail-action-group-slack-email.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.Resources/deployments/pcq-alert"
        name                     = "pcq-alert"
      ~ output_content           = jsonencode(
            {
              - actionGroupId = {
                  - type  = "String"
                  - value = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/microsoft.insights/actionGroups/PCQ Consolidation Fail Slack Email Alert - aat"
                }
            }
        ) -> (known after apply)
      ~ parameters_content       = (sensitive value)
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.pcq-consolidation-summary-action-group-slack.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.Resources/deployments/pcq-conso"
        name                     = "pcq-conso"
      ~ output_content           = jsonencode(
            {
              - actionGroupId = {
                  - type  = "String"
                  - value = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/microsoft.insights/actionGroups/PCQ Consolidation Summary Slack Alert - aat"
                }
            }
        ) -> (known after apply)
      ~ parameters_content       = (sensitive value)
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.pcq-disposer-fail-action-group-slack.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.Resources/deployments/pcq-disposer"
        name                     = "pcq-disposer"
      ~ output_content           = jsonencode(
            {
              - actionGroupId = {
                  - type  = "String"
                  - value = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/microsoft.insights/actionGroups/PCQ Disposer Fail Slack Alert - aat"
                }
            }
        ) -> (known after apply)
      ~ parameters_content       = (sensitive value)
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.pcq-disposer-summary-action-group-slack.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.Resources/deployments/pcq-sum"
        name                     = "pcq-sum"
      ~ output_content           = jsonencode(
            {
              - actionGroupId = {
                  - type  = "String"
                  - value = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/microsoft.insights/actionGroups/PCQ Disposer Summary Slack Alert - aat"
                }
            }
        ) -> (known after apply)
      ~ parameters_content       = (sensitive value)
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.pcq-loader-failure-action-group-slack.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/Microsoft.Resources/deployments/pcq-loader"
        name                     = "pcq-loader"
      ~ output_content           = jsonencode(
            {
              - actionGroupId = {
                  - type  = "String"
                  - value = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-aat/providers/microsoft.insights/actionGroups/PCQ Loader Failure Slack Alert - aat"
                }
            }
        ) -> (known after apply)
      ~ parameters_content       = (sensitive value)
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

Plan: 5 to add, 6 to change, 5 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":165,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->